"""
    # Задачі 04 -10:
    # Переведіть задачі з книги "Математика, 5 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в п'ятому класі
"""
# task 04
"""
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""

Azov_sea = 436402
Black_sea = 37800

print("Total area of 2 seas", Azov_sea+Black_sea,"км2")


# task 05
"""
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""

Warehouse_1_2  = 250449
Warehouse_2_3 = 222950
All_goods = 375291

Warehouse_2 = (Warehouse_1_2 + Warehouse_2_3 - All_goods)
Warehouse_1 = (Warehouse_1_2 - Warehouse_2)
Warehouse_3 = (Warehouse_2_3 - Warehouse_2)


print("First Warehouse", Warehouse_1)
print("Second Warehouse", Warehouse_2)
print("Third Warehouse", Warehouse_3)
"""
# task 06
"""
"""Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера."""

Part_payment_month = 1179

print("Full PC price", Part_payment_month * 18, "грн")

# task 07
"""
Знайди остачу від діленя чисел:
a) 8019 : 8     d) 7248 : 6
b) 9907 : 9     e) 7128 : 5
c) 2789 : 5     f) 19224 : 9
"""

a = 8019
b = 9907
c = 2789
d = 7248
e = 7128
f = 19224

print(
    "A:", a % 8, "\n",
    "B:", b % 9, "\n",
    "C:", c % 5, "\n",
    "D:", d % 6, "\n",
    "E:", e % 5, "\n",
    "F:", f % 9, "\n"
)


# task 08
"""
Іринка, готуючись до свого дня народження, склала список того,
що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
для даного її замовлення.
Назва товару    Кількість   Ціна
Піца велика     4           274 грн
Піца середня    2           218 грн
Сік             4           35 грн
Торт            1           350 грн
Вода            3           21 грн
"""

Pizza_big = 274
Pizza_middle = 218
Juice = 35
Cake = 350
Water = 21

All_cost = Pizza_big *4 + Pizza_middle*2 + Juice *4 + Cake + Water*3

print("Price of the order in supermarket", All_cost, "грн")

# task 09
"""
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
All_photos = 232
One_page_album = 8

Quantity_photos_in_album = All_photos//8

print("Pages in album", Quantity_photos_in_album)

# task 10
"""
Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить 1600 км. Відомо,
що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
становить 48 літрів.
1) Скільки літрів бензину знадобиться для такої подорожі?
2) Скільки щонайменше разів родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак?
"""

Distance = 1600
Consumption_per_100 = 9
Full_tank = 48

Overall_fuel_consumption = (Distance /100) * Consumption_per_100
Gas_station_check = Overall_fuel_consumption/Full_tank
print("Patrol liters ",Overall_fuel_consumption)
print("Minimum gas station stops",Gas_station_check)